purchases = [
    ("Ноутбук", 2, 1000),
    ("Мышь", 5, 20),
    ("Клавиатура", 3, 50),
    ("Наушники", 2, 150),
    ("Монитор", 1, 300),
    ("Флешка", 10, 15),
    ("Принтер", 1, 200),
    ("Роутер", 1, 120),
    ("Беспроводная клавиатура", 2, 70),
    ("Мышь для геймеров", 1, 80),
    ("Внешний жесткий диск", 3, 120),
    ("Гарнитура", 2, 50),
    ("Коврик для мыши", 5, 10),
    ("Камера для веб-конференций", 1, 180),
    ("Графический планшет", 1, 250),
    ("Эргономичное кресло", 1, 400),
    ("Стол для компьютера", 1, 150),
    ("Лампа для рабочего места", 2, 30),
    ("Батарейки AAA", 20, 2),
    ("Материнская плата", 1, 180),
]

for item in purchases:
    print(item[0], item[1] * item[2])

# students = [
#     ("Анна", 19, ["Математика", "Информатика"]),
#     ("Иван", 22, ["Физика", "Информатика"]),
#     ("Мария", 19, ["Литература", "Искусство"]),
#     ("Алексей", 20, ["Химия", "Биология"]),
#     ("Елена", 21, ["Физика", "Искусство"]),
#     ("Дмитрий", 18, ["Математика", "Литература"]),
#     ("Ольга", 22, ["Информатика", "Биология"]),
#     ("Павел", 20, ["Искусство", "Физика"]),
#     ("Алина", 19, ["Информатика", "Математика"]),
#     ("Артем", 21, ["Биология", "Химия"]),
#     ("Наталья", 18, ["Литература", "Искусство"]),
#     ("Сергей", 23, ["Информатика", "Физика"]),
#     ("Евгения", 20, ["Химия", "Биология"]),
#     ("Андрей", 24, ["Искусство", "Литература"]),
#     ("Виктория", 22, ["Физика", "Информатика"]),
#     ("Максим", 19, ["Биология", "Химия"]),
#     ("Юлия", 21, ["Информатика", "Физика"]),
#     ("Кирилл", 20, ["Математика", "Биология"]),
#     ("Анастасия", 23, ["Литература", "Искусство"]),
#     ("Роман", 18, ["Информатика", "Физика"]),
# ]

# sp_curs = set()
# vgroupl21 = []
# vgroup21 = []

# for i in students:
#     for j in i[2]:
#         sp_curs.add(j)
#     if i[1] < 21:
#         vgroupl21.append(i[0])
#     else:
#         vgroup21.append(i[0])

# print(*sorted(sp_curs))
# print(*sorted(vgroupl21))
# print(*sorted(vgroup21))
